"""
Є список IP адрес:

IP = [
    "85.157.172.253",
    ...
]
Реалізуйте дві функції.
Перша get_count_visits_from_ip за допомогою Counter повертатиме словник,
де ключ це IP, а значення – кількість входжень у вказаний список.

Приклад:
{
    '85.157.172.253': 2,
    ...
}

Друга функція get_frequent_visit_from_ip повертає кортеж з найбільш
часто уживаним в списку IP і кількістю його появ в списку.

Приклад:
('66.50.38.43', 4)
"""

from collections import Counter


def get_count_visits_from_ip(ips):
    return Counter(ips)
    

def get_frequent_visit_from_ip(ips):
    return Counter(ips).most_common(1)[0]


IP = [
    "85.157.172.253",
    "85.157.172.253",
    "85.157.172.253",
    "203.128.37.192",
    "203.128.37.192",
    "94.76.192.110",
    "178.23.45.67",
    "115.92.130.244",
    "72.33.94.17",
    "121.55.208.78",
    "59.201.83.36",
    "103.48.61.216",
    "208.77.89.101",
    "66.146.35.72",
    "172.98.143.209",
    "88.212.56.129",
    "190.14.67.55",
    "97.185.240.13",
    "35.68.173.84",
    "126.39.214.70",
    "64.251.106.33",
    "149.37.228.77",
    "81.72.205.46",
    "112.95.63.168"
]


print(get_count_visits_from_ip(IP))
print(get_frequent_visit_from_ip(IP))